{
    "title": "Roasted Pork Tenderloin",
    "subtitle": "with potatoes and zucchini",
    "instructions": [
        {
            "text": "Adjust racks to top and middle positions and preheat oven to 450 degrees. Wash and dry all produce. Dice potatoes into ½-inch pieces; toss on a baking sheet with a drizzle of olive oil and a pinch of salt and pepper. Roast on top rack, tossing halfway through, until browned and tender, 20-25 minutes."
        },
        {
            "text": "Halve, peel, and dice onion into ½-inch pieces. Halve lemon. Trim and halve zucchini lengthwise; slice crosswise into ½-inch thick half-moons."
        },
        {
            "text": "Pat pork dry with paper towels; season all over with salt and pepper. Heat a drizzle of olive oil in a large pan over medium-high heat. Add pork and sear, turning occasionally, until browned all over, 4-8 minutes total. Turn off heat."
        },
        {
            "text": "Toss onion and zucchini on one side of a second baking sheet with a drizzle of olive oil and a pinch of salt and pepper. Transfer pork to empty side. Roast on middle rack until veggies are tender and pork is cooked through, 10-12 minutes. Let pork rest 5 minutes after removing from oven. TIP: If veggies finish cooking first, remove from sheet and continue cooking pork."
        },
        {
            "text": "Melt 2 tbsp butter in pan used for pork over medium-high heat. Add garlic and cook until fragrant, 30 seconds. Stir in demi-glace and ¼ cup water, scraping up any browned bits from bottom of pan. Simmer until slightly reduced, 3-4 minutes. Turn off heat. Season with pepper and a squeeze of lemon juice."
        }
    ],
    "servings": 4,
    "sources": [
        {
            "name": "HelloFresh",
            "url": "https://www.hellofresh.com/recipes/roasted-pork-tenderloin-5e5e9a1bba47be36e310dceb"
        }
    ],
    "ingredients": [
        {
            "list": "Ingredients",
            "item": "Pork Tenderloin",
            "amount": "24",
            "unit": "oz"
        },
        {
            "list": "Ingredients",
            "item": "Baby Yellow Potatoes",
            "amount": "24",
            "unit": "oz"
        },
        {
            "list": "Ingredients",
            "item": "Red Onion",
            "amount": "1"
        },
        {
            "list": "Ingredients",
            "item": "Zucchini",
            "amount": "2"
        },
        {
            "list": "Ingredients",
            "item": "Lemon",
            "amount": "1"
        },
        {
            "list": "Staples",
            "item": "Olive Oil",
            "amount": "1",
            "unit": "tbsp"
        },
        {
            "list": "Staples",
            "item": "Butter",
            "amount": "2",
            "unit": "tbsp"
        },
        {
            "list": "Staples",
            "item": "Minced Garlic",
            "amount": "2",
            "unit": "tbsp"
        },
        {
            "list": "Staples",
            "item": "Salt",
            "amount": "1",
            "unit": "tsp"
        },
        {
            "list": "Staples",
            "item": "Black Pepper",
            "amount": "1",
            "unit": "tsp"
        }
    ]
}